#ifndef HAL_MYRTC_H
#define HAL_MYRTC_H

#include "stm32f1xx_hal.h"
#include "hal_types.h"
#include "rtc.h"
//***********************************************************************
//						Встроенный модуль часов реального времени (RTC) 
//***********************************************************************
/* 
	Установка времени через мобас ASCII
	Обновление текущего времени
	
	!!! Записывать время через модбас ASCII сначало регистр 
	0x0023-часы,0x0024-минуты и последним 0x0025-секунды
	
	!!! Для ch32 регистр OCTLR_CAL_ADR не записывается, 
	при ручном изменении в отладке никак не влияет на время.
*/
//-----------------------------------------------------------------------
#define RTC_S_VALVE  					 2						// кол-во клапанов		
#define RTC_BKP_OCTLR_CAL_ADR  0x40006C28		// адрес регистра калибровки для stm32

volatile typedef struct 									 
{	
	RTC_HandleTypeDef* hrtc;									// Струкура для работы с модулем RTC
	RTC_TimeTypeDef 	 tm_now;								// Текущее время
	RTC_TimeTypeDef 	 tm_setup;							// Новое время для установки	
	u8								 bkp_octlr_cal;					// Значение калибровочного регистра (RTC_SETUP_COR=0)/поправка в сек.(RTC_SETUP_COR=1)
} RTC_sObj; 																// Cтруктура - параметры объекта управления

/************************************************************************
								Прототипы глобальных переменных модуля
*************************************************************************/
extern RTC_sObj RTC_obj;																									// Новое время для установки
//-----------------------------------------------------------------------

//***********************************************************************
//								Прототипы глобальных функций модуля
//***********************************************************************
void RTC_Init(RTC_HandleTypeDef* _hrtc);																	// Iнициализация модуля RTC
void RTC_Handler(void);		 																								// Обработчик модуля RTC (положить в Main)
//-----------------------------------------------------------------------

#endif
