#ifndef HAL_FLASH_H
#define HAL_FLASH_H

//*********************************************************************
//							Таблица секторов флеш памяти STM32F103C8T6
//*********************************************************************
// Общий объем Flash памяти 64 кб

// 0x08000000 -> 0x08003FFF -> 16 кб -> Загрузчик
// 0x08004000 -> 0x08004FFF -> 	4 кб -> Загрузчик загрузчика
// 0x08005000 -> 0x0800F7FF -> 42 кб ->	Основная прошивка
// 0x0800F800 -> 0x0800FBFF ->  1 кб ->	Конфигурация
// 0x0800FC00 -> 0x0800FFFF ->  1 кб ->	Конфигурация - резервная страница

// Стерание по страницам 1024 байта -> 1 кб
//---------------------------------------------------------------------
/*
	Code - размер всего кода
	RO-data - константы в коде (Read Only Data)
	RW-data - переменные (Read Write Data)
	ZI-data - переменные (Zero-Initialized Data)
	
	Подробный отчет в MAP файле проекта
*/
//---------------------------------------------------------------------

#include "stm32f1xx_hal.h"
#include "hal_types.h"

#define FLASH_S_ADR_FLASH	(u32)0x08000000 							 // Начальный адрес флеш памяти

/************************************************************************
							 Прототипы глобальных функций и методов модуля
*************************************************************************/
u16  Flash_Read_16(u32 adress); 							  			 	 // прочитать 2 байта флеш памяти (адрес ячейки)
u32  Flash_Read_32(u32 adress); 							  			 	 // прочитать 4 байта флеш памяти (адрес ячейки)
void Flash_Read_Buf(u32 adr_r, u8* link_buf, u16 size);	 // Чтение данных из массива
	
void Flash_Write_16(u32 adress, u16 data);  				 		 // запись во флеш данные 2 байта по указанному адресу
void Flash_Write_32(u32 adress, u32 data);					 		 // запись во флеш данные 4 байта по указанному адресу
void Flash_Write_Buf(u32 adr_w, u8* link_buf, u16 size); // Запись данных из масива

void Flash_Clear_Sector(u32 sector);                   	 // стереть сектор флеш в соответствии с таблицей

void Flash_Jump_Adress(u32 adress);											 // перейти по адресу в область другой программы
//------------------------------------------------------------------------

#endif
