#ifndef HAL_MYUSB_H
#define HAL_MYUSB_H

#include "stm32f1xx_hal.h"
#include "hal_types.h"
#include "usb_device.h"
#include "usbd_cdc_if.h"

//*********************************************************************
//						
//*********************************************************************
/* 
	
*/
//---------------------------------------------------------------------

volatile typedef struct
{
	USBD_CDC_HandleTypeDef *hcdc;
	
	
}USB_Struct;																				// Структура устр-ва NRF24

extern USB_Struct USB_port;

//***********************************************************************
//						Прототипы глобальных методов и функций модуля
//***********************************************************************
void USB_Init(void);																											// Инициализация модуля 
void USB_Handler(void);		 																								// Обработчик модуля (положить в Main)
void USB_Handler_Tm(void);																								// Обработчик интервалов для модуля (положить в таймер 1мс)

//-----------------------------------------------------------------------

#endif
