#ifndef HAL_MY_EXTI_CALLBACKS_H
#define HAL_MY_EXTI_CALLBACKS_H

#include "stm32f1xx_hal.h"
#include "hal_types.h"

//*********************************************************************
// 					Обработка данных в CALLBACK функциях EXTI прерываний
//*********************************************************************

/**********************************************************************
							 Прототипы глобальных функций и методов модуля
***********************************************************************/
// Отсутствуют
//---------------------------------------------------------------------

#endif
