#ifndef HAL_I2C_1602_H
#define HAL_I2C_1602_H

#include "stm32f1xx_hal.h"
#include "stm32f1xx_hal_i2c.h"
#include "hal_types.h"

//***********************************************************************
//									Модуль управления LCD дисплеем 1602A
//***********************************************************************
/*  
	Описание управляющих контактов LCD:
		E  - строб (перход от 1 к 0)
		RW - чтение 1 \ запись 0
		RS - дата   1 \ команда 0
	
	Используется шина I2C (на дисплее установлен расширитель I2C),
	поэтому обмен данными организован в 4 битном режиме.
	
	Таблица бит данных для I2C расиширителя (PCF8574AT):
	
		D7 D6 D5 D4 X  E  RW RS
		7	 6  5  4  3  2  1  0
		
	Данные по шине в 4 битном режиме передаются по тетрадам:
		1. старшая тетрада данных | тетрада с битами управления (x e rw rs);
		2. младшая тетрада данных | тетрада с битами управления (x e rw rs);
*/
//-----------------------------------------------------------------------
#define LCD1602_I2C_ADRESS_DEF		0x27U 			// адрес дисплея на шине I2C (по умолчанию 0x27)
#define LCD1602_I2C_SCAN_MS 			5U  				// Ожидание выполнения операции на шине I2C (в мс)
#define LCD1602_I2C_TM_MS 				100U  			// Ожидание выполнения операции на шине I2C (в мс)

#define LCD1602_START_MS					30U					// Задержка - ожидание готовности дисплея
#define LCD1602_INIT_MS 					5U  				
#define LCD1602_SETUP_MS 					2U  							

#define LCD1602_CONNECT		 				1U 					// LCD на связи
#define LCD1602_DISCONNECT 				0U 		
 
#define LCD1602_BACKLIGHT_ON		 	1U 					// вкл. подсветку LCD
#define LCD1602_BACKLIGHT_OFF			0U 
#define LCD1602_BACKLIGHT_TM_MS		30000U			// Задержка - выкл. подсветки (мс)

#define LCD1602_ROW_1							0x80U 			// 1 строка
#define LCD1602_ROW_2							0xC0U 		

#define LCD1602_COL_1							0U 					// 1 колонка
#define LCD1602_COL_2							1U 
#define LCD1602_COL_3							2U 
#define LCD1602_COL_4							3U 
#define LCD1602_COL_5							4U 
#define LCD1602_COL_6							5U
#define LCD1602_COL_7							6U 
#define LCD1602_COL_8							7U 
#define LCD1602_COL_9							8U 
#define LCD1602_COL_10						9U	 
#define LCD1602_COL_11						10U	 
#define LCD1602_COL_12						11U	 
#define LCD1602_COL_13						12U	 
#define LCD1602_COL_14						13U	 
#define LCD1602_COL_15						14U	 
#define LCD1602_COL_16						15U	 

#define LCD1602_BIT_D7 						0x50U 			// 0b10000000 бит данных D7
#define LCD1602_BIT_D6 						0x40U 			// 0b01000000 бит данных D6
#define LCD1602_BIT_D5 						0x20U 			// 0b00100000 бит данных D5
#define LCD1602_BIT_D4 						0x10U 			// 0b00010000 бит данных D4
#define LCD1602_BIT_NONE 					0x08U 			// 0b00001000 бит не используется
#define LCD1602_BIT_EN 						0x04U 			// 0b00000100 бит строба (En)
#define LCD1602_BIT_RW 						0x02U 			// 0b00000010 бит выбора запись  0 \ чтения 1 (Rw)
#define LCD1602_BIT_RS 						0x01U 			// 0b00000001 бит выбора команды 0 \ данных 1 (Rs)

// байты управления
#define LCD1602_BYTE_EN1_RW0_RS0 	0x04U 			// 0b00000100 байт для записи команд En=1; Rs=0			
#define LCD1602_BYTE_EN1_RW0_RS1	0x05U 			// 0b00000101 байт для записи данных En=1; Rs=1	
#define LCD1602_BYTE_EN0_RW0_RS1 	0x01U 			// 0b00000001 байт для записи данных En=0; Rs=1	
// байты данных
#define LCD1602_BYTE_CLEAR 				0x01U 			// 0b00000001 байт данных для очистки дисплея		
#define LCD1602_BYTE_LED_ON 			0x08U 			// 0b00001000 байт включения подсветки дисплея	
#define LCD1602_BYTE_BLINK_ON			0x0FU 			// 0b00000000 байт вкл. дисплей; вкл. курсор; вкл. мигание курсора		
#define LCD1602_BYTE_BLINK_OFF 		0x0CU 			// 0b00000000 байт вкл. дисплей; выкл. курсор; выкл. мигание курсора		
#define LCD1602_BYTE_NULL 				0x00U 						

volatile typedef struct 									 
{	
	I2C_HandleTypeDef* hi2c;										// структура для работы с шиной i2c
	u8								 adr;											// адрес устр-ва на шине i2c	
	bool 							 fl_cn;										// текущее состояние связи шине i2c	(connection)
	u8 								 mass[64];								// массив	данных для обмена данными по шине i2c
	
	u16								 cnt_bkl;									// счетчик для выкл. подсветки, после заданного интервала времени (мс)
	bool 							 fl_bk;										// текущее состояние подсветки дисплея	
	
} LCD1602_Obj; 									  						// Cтруктура - параметры объекта управления
//-----------------------------------------------------------------------

/************************************************************************
								Прототипы глобальных переменных модуля
*************************************************************************/

//-----------------------------------------------------------------------

/************************************************************************
									Прототипы глобальных функций модуля
*************************************************************************/
void LCD1602_Init(I2C_HandleTypeDef* hhi2c_x); 													// Инициализация LCD_1602 через шину I2C
void LCD1602_Handler_Tm(void);																					// Обработчик данных модуля в таймере (положить в таймер 1мс)

void LCD1602_Write_Data(u8* data, u8 size);															// Вывод данных на дисплей
void LCD1602_Jump_Cursor(u8 row, u8 col);																// Переместить курсор по адресу
void LCD1602_Jump_Cursor_And_Write_Data(u8 row, u8 col, u8* data, u8 size); // Переместить курсор по адресу и записать данные

void LCD1602_Led_On(void);																							// Включить подсветку дисплея  
void LCD1602_Led_Off(void);																							// Выключить подсветку дисплея (узнать адрес LCD)  
bool LCD1602_Get_State_Led(void);																				// Получить сост-е подсветки дисплея
//-----------------------------------------------------------------------

#endif

