#include "hal_my_exti_callbacks.h"
#include "hal_nrf24l01_drv.h"
	
/**********************************************************************
									Прототипы всех функций и методов модуля
***********************************************************************/
void HAL_GPIO_EXTI_Callback(u16 GPIO_Pin);															// Callback функция - прерывание по спаду или нарастанию фронта
//---------------------------------------------------------------------	

//*********************************************************************
//								Описание всех функций и методов модуля
//*********************************************************************
/**
	* @brief  					Callback функция - прерывание по спаду или нарастанию фронта
	* @param  GPIO_Pin: Нога по которой сработало прерывание
  */
void HAL_GPIO_EXTI_Callback(u16 GPIO_Pin)
{
	if(GPIO_Pin == GPIO_PIN_1)
		NRF24_dev.alg = NRF24_ALG_IRQ;
}
